IDEA StatiCa Open Model
ConcreteULSCheckResultFatigueEc2 Properties
Compatible with IDEA StatiCa Beta 21.0 - beta
The ConcreteULSCheckResultFatigueEc2 type exposes the following members.
Properties
Name | Description
DecissionMethod
 decision fatigue check
Check
 settings of check type
 (Inherited from ConcreteCheckResultBase.)
CheckValue
 calculated limited value, calculated as strain to limit strain
 (Inherited from ConcreteCheckResultBase.)
InternalForceMax
 internal forces for fatigue calculation max
InternalForceMin
 internal forces for fatigue calculation min
InternalFores
 internal forces used for calculation
 (Inherited from ConcreteCheckResultBase.)
LimitCheckValue
 limit check value for result check
 (Inherited from ConcreteCheckResultBase.)
NonConformities
 Returns nonconformity in section
 (Inherited from ConcreteCheckResultBase.)
Result
 check result passed/failed
 (Inherited from ConcreteCheckResultBase.)
Top
See Also
Reference
ConcreteULSCheckResultFatigueEc2 Class
IdeaRS.OpenModel.Concrete.CheckResult Namespace